# GetExportLinetypeInfo Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTable..::..GetExportLinetypeInfo Method
ExportLinetypeTable Class See Also
---
Gets a copy of the ExportLinetypeInfo corresponding to the given ExportLinetypeKey.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportLinetypeInfo GetExportLinetypeInfo(
	ExportLinetypeKey exportLinetypeKey
)
```

Visual Basic
---
```text
Public Function GetExportLinetypeInfo ( _
	exportLinetypeKey As ExportLinetypeKey _
) As ExportLinetypeInfo
```

Visual C++
---
```text
public:
ExportLinetypeInfo^ GetExportLinetypeInfo(
	ExportLinetypeKey^ exportLinetypeKey
)
```

# ### Parameters
exportLinetypeKey
    Type: Autodesk.Revit.DB..::..ExportLinetypeKey The export line type Key.
# ### Return Value
Returns the line type info for this key.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | An entry with the given key is not present in the table. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace